app/views/users/show.html.erb

SELECT "registrations".* FROM "registrations" WHERE "registrations"."user_id" = 3
---

    <% @user.registrations.each do |reg| %>