app/views/events/_form.html.erb

    <%= form.label :category_id, "Category", class: "form-label" %>
    <%= form.select :category_id, Category.all.map { |c| [c.name, c.id] }, { prompt: "Select a category" }, class: "form-select", required: true %>
---
SELECT "categories".* FROM "categories"

    <%= form.label :venue_id, "Venue", class: "form-label" %>
    <%= form.select :venue_id, Venue.all.map { |v| [v.name, v.id] }, { prompt: "Select a venue" }, class: "form-select", required: true %>
---
SELECT "venues".* FROM "venues"