app/views/events/show.html.erb

              <li class="list-group-item">
                ✅ <%= registration.user.first_name %> <%= registration.user.last_name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1

              <div class="d-flex justify-content-between">
                <strong><%= review.user.first_name %> <%= review.user.last_name %></strong>
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (3, 2)


    <% if @event.finished? &&
      current_user &&
      @event.registrations.exists?(
        user: current_user,
        status: :confirmed
      ) %>
---
SELECT "registrations".* FROM "registrations" WHERE "registrations"."event_id" = 6 AND "registrations"."status" = 3 ORDER BY "registrations"."created_at" ASC
SELECT 1 AS one FROM "registrations" WHERE "registrations"."event_id" = 3 AND "registrations"."user_id" = 4 AND "registrations"."status" = 1 LIMIT 1