app/views/events/show.html.erb

              <li class="list-group-item">
                ✅ <%= registration.user.first_name %> <%= registration.user.last_name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1

              <div class="d-flex justify-content-between">
                <strong><%= review.user.first_name %></strong>
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (3, 2)