app/views/events/show.html.erb

              <div class="d-flex justify-content-between">
                <strong><%= review.user.first_name %></strong>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1