app/views/venues/index.html.erb

SELECT COUNT(*) FROM "events" WHERE "events"."venue_id" = 1
---
            <p class="text-muted mb-3">
              <i class="bi bi-calendar-event"></i> <%= pluralize(venue.events.count, 'event') %>