app/views/venues/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."venue_id" = 1
---

  <% @venue.events.each do |event| %>