app/controllers/admin_controller.rb

  def dashboard
    @total_users = User.count
    @total_events = Event.count
    @total_registrations = Registration.count
    @total_reviews = Review.count
    @recent_users = User.order(created_at: :desc).limit(5)
    @recent_events = Event.includes(:organizer, :category).order(created_at: :desc).limit(5)
    @events_by_status = Event.group(:status).count
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "events"
SELECT COUNT(*) FROM "registrations"
SELECT COUNT(*) FROM "reviews"
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC LIMIT 5
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (3, 5, 1, 4)
SELECT "events".* FROM "events" ORDER BY "events"."created_at" DESC LIMIT 5
SELECT COUNT(*) AS "count_all", "events"."status" AS "events_status" FROM "events" GROUP BY "events"."status"