app/controllers/categories_controller.rb

  def show
    @events = @category.events.includes(:venue, :organizer)
---
SELECT "events".* FROM "events" WHERE "events"."category_id" = 1

  def create
    authorize! :create, Category
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at", "description") VALUES ('2026-05-23 04:08:15.463714', 'Party', '2026-05-23 04:08:15.463714', 'party rock') RETURNING "id"

  def destroy
    authorize! :destroy, @category

    if @category.events.any?
      redirect_to @category, alert: "Cannot delete category with existing events."
    else
      @category.destroy
---
SELECT 1 AS one FROM "events" WHERE "events"."category_id" = 4 LIMIT 1
DELETE FROM "categories" WHERE "categories"."id" = 4