app/controllers/events_controller.rb

UPDATE "events" SET "updated_at" = '2026-06-05 23:50:09.300970' WHERE "events"."id" = 8
---
  def update
    unless @event.organizer == current_user
      redirect_to @event, alert: "You can only edit your own events."
      return
    end

    if @event.update(event_params)

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
---
  def set_current_user
    @current_user = User.first