app/controllers/events_controller.rb

  def index
    @events = Event.includes(:category, :venue, :organizer).all
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (1, 2, 3)
SELECT "events".* FROM "events"
SELECT "venues".* FROM "venues" WHERE "venues"."id" IN (1, 2, 3)

  def show
    @reviews = @event.reviews.includes(:user).order(created_at: :desc)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."event_id" = 3 ORDER BY "reviews"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (3, 2)

  def create
    @event = Event.new(event_params)
    @event.organizer = current_user
    @event.status = :draft

    if @event.save
---
INSERT INTO "events" ("category_id", "created_at", "description", "end_date", "max_attendees", "organizer_id", "start_date", "status", "title", "updated_at", "venue_id") VALUES (2, '2026-06-05 19:04:04.468115', NULL, '2026-06-06 17:03:00', 12, 4, '2026-06-06 15:03:00', 0, 'test', '2026-06-05 19:04:04.468115', 2) RETURNING "id"

  def update
    unless @event.organizer == current_user
      redirect_to @event, alert: "You can only edit your own events."
      return
    end

    if @event.update(event_params)
---
UPDATE "events" SET "end_date" = '2026-05-11 05:33:42', "start_date" = '2026-05-11 01:33:42', "updated_at" = '2026-05-24 20:30:44.950098' WHERE "events"."id" = 2

  def destroy
    unless @event.organizer == current_user
      redirect_to events_path, alert: "You can only delete your own events."
      return
    end

    @event.destroy
---
DELETE FROM "events" WHERE "events"."id" = 7

  def publish
    unless @event.organizer == current_user
      redirect_to @event, alert: "You can only publish your own events."
      return
    end

    if @event.update(status: :published)
---
UPDATE "events" SET "status" = 1, "updated_at" = '2026-05-24 03:04:52.280071' WHERE "events"."id" = 6

  def cancel
    unless @event.organizer == current_user
      redirect_to @event, alert: "You can only cancel your own events."
      return
    end

    if @event.update(status: :cancelled)
---
UPDATE "events" SET "status" = 2, "updated_at" = '2026-05-24 20:29:15.189699' WHERE "events"."id" = 1

  def set_current_user
    @current_user = User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1