app/controllers/registrations_controller.rb

  def create
    @registration = @event.registrations.build(user: current_user)

    if @registration.save
---
INSERT INTO "registrations" ("created_at", "event_id", "status", "updated_at", "user_id") VALUES ('2026-05-24 02:56:37.255619', 1, 1, '2026-05-24 02:56:37.255619', 1) RETURNING "id"

  def destroy
    @registration = @event.registrations.find(params[:id])

    unless @registration.user == current_user
      redirect_to @event, alert: "You can only cancel your own registrations."
      return
    end

    @registration.destroy
---
SELECT "registrations".* FROM "registrations" WHERE "registrations"."event_id" = 1 AND "registrations"."id" = 4 LIMIT 1
DELETE FROM "registrations" WHERE "registrations"."id" = 4

  def set_current_user
    # For now, we'll use the first user as current user
    @current_user = User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1