app/controllers/reviews_controller.rb

  def create
    @review = @event.reviews.build(review_params)
    @review.user = @current_user

    if @review.save
      redirect_to @event, notice: "Review created successfully."
    else
      flash[:alert] = @review.errors.full_messages.join(", ")
---
INSERT INTO "reviews" ("comment", "created_at", "event_id", "rating", "updated_at", "user_id") VALUES ('wow', '2026-05-24 21:41:02.697374', 2, 5, '2026-05-24 21:41:02.697374', 1) RETURNING "id"
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1

  def set_current_user
    # For now, we'll use the first user as current user
    @current_user = User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1