app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @registrations = @user.registrations.includes(:event)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
SELECT "registrations".* FROM "registrations" WHERE "registrations"."user_id" = 3