app/controllers/venues_controller.rb

SELECT "events".* FROM "events" WHERE "events"."venue_id" = 1
---
  def show
    @events = @venue.events.includes(:category, :organizer)

INSERT INTO "venues" ("address", "capacity", "created_at", "name", "updated_at") VALUES ('h', 200, '2026-05-23 04:08:00.921378', 'Humanidades', '2026-05-23 04:08:00.921378') RETURNING "id"
---
  def create
    authorize! :create, Venue
    @venue = Venue.new(venue_params)

    if @venue.save

SELECT 1 AS one FROM "events" WHERE "events"."venue_id" = 4 LIMIT 1
DELETE FROM "venues" WHERE "venues"."id" = 4
---
  def destroy
    authorize! :destroy, @venue

    if @venue.events.any?
      redirect_to @venue, alert: "Cannot delete venue with existing events."
    else
      @venue.destroy

SELECT "venues".* FROM "venues" WHERE "venues"."id" = 1 LIMIT 1
---
  def set_venue
    @venue = Venue.find(params[:id])