app/models/review.rb

  def user_attended_event
    registration = Registration.find_by(
      user: user,
      event: event,
      status: :confirmed
    )
---
SELECT "registrations".* FROM "registrations" WHERE "registrations"."user_id" = 1 AND "registrations"."event_id" = 2 AND "registrations"."status" = 1 LIMIT 1