app/views/categories/index.html.erb

SELECT COUNT(*) FROM "events" WHERE "events"."category_id" = 1
---
          <p class="text-muted mb-0">
            <%= category.events.count %> events