app/views/categories/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."category_id" = 1
---

    <% @category.events.each do |event| %>